In [1]:
import pandas as pd
import os
from sqlalchemy  import create_engine  as sql
from dotenv import load_dotenv

In [2]:
load_dotenv()
#conexion a la base de datos
name_db = os.getenv('DB_NAME')
name_db2 = os.getenv('DB_NAME2')
user_db = os.getenv('DB_USER')
password_db = os.getenv('DB_PASSWORD')
host_db = os.getenv('DB_HOST')
port_db = os.getenv('DB_PORT')

In [3]:
try:
    engine = sql(f"postgresql+psycopg://{user_db}:{password_db}@{host_db}:{port_db}/{name_db}")
    print(f'Conexion exitosa a la base de datos {name_db}')
except Exception as e:
    print('Error al conectarte a la base de datos:', e)

Conexion exitosa a la base de datos movies_netflix_db

In [9]:
print(name_db, host_db)
query = """
select 
    movies.movieID as "movieID", 
    movies.title as "title",
    movies.releaseDate as "releaseDate", 
    gender.name as "gender", 
    person.name as "participantName", 
    participant.participantRole as "roleParticipant"
from movies 
inner join participant 
    on movies.movieID = participant.movieID
inner join person
    on participant.personID = person.personID
inner join movieGender
    on movies.movieID = movieGender.movieID
inner join gender
    on movieGender.genderID = gender.genderID;
"""
movies_df = pd.read_sql(query, engine)
movies_df['movieID'] = movies_df['movieID'].astype(int)
# movies_df.columns = [col[0].upper() + col[1:] for col in movies_df.columns]
movies_df

movies_netflix_db localhost

,movieID,title,releaseDate,gender,participantName,roleParticipant
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor

In [10]:
movies_award_df = pd.read_csv('../Data/Awards_movie.csv')
# print(movies_award_df.dtypes)
movies_award_df.rename(columns={'Aware':'Award'},inplace=True)
# movies_award_df.columns = [col[0].upper() + col[1:] for col in movies_award_df.columns]
# movies_award_df.columns = movies_award_df.columns.str.capitalize()
movies_award_df

    movieID  IdAward   Award
0  80210920        0   Oscar
1  81157374        1  Grammy
2  80192187        2   Oscar

In [11]:
movies_df = pd.merge(movies_df, movies_award_df, left_on='movieID', right_on='movieID')
movies_df

,movieID,title,releaseDate,gender,participantName,roleParticipant,IdAward,Award
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,2,Oscar
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director,1,Grammy
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,0,Oscar

In [12]:
try:
    engine = sql(f"postgresql+psycopg://{user_db}:{password_db}@{host_db}:{port_db}/{name_db2}")
    print(f'Conexion exitosa a la base de datos {name_db2}')
except Exception as e:
    print('Error al conectarte a la base de datos:', e)

Conexion exitosa a la base de datos netflix_db

In [13]:
movies_df = movies_df.rename(columns = {'Award': 'awardMovie'})
movies_df = movies_df.drop(columns=['IdAward'])
movies_df.head()

,movieID,title,releaseDate,gender,participantName,roleParticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director,Grammy
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar

In [ ]:
movies_df.to_sql('movies', engine, if_exists='append', index=False)

Engine(postgresql+psycopg://postgres:***@localhost:5432/netflix_db)

-1

In [17]:
pd.read_sql('movies', engine)

,movieID,title,releaseDate,gender,participantName,roleParticipant,awardMovie
0,80192187,Triple Frontier,2019-04-12,Action,Joseph Chavez Pineda,Actor,Oscar
1,81157374,Run,2021-05-21,Adventure,Maria Lopez Gutierrez,Director,Grammy
2,80210920,The Mother,2023-01-05,Drama,Maria Alejandra Navarro,Actor,Oscar

In [18]:

users_df = pd.read_csv('../Data/users.csv', sep='|')
users_df.head()

    idUser     username    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [19]:
users_df = users_df.rename(columns={'idUser':'userID', 'username': 'userName'})
users_df.head()

    userID     userName    country subscription
0  1002331      user123        USA      Premium
1  1002332  gamerGirl97     Canada        Basic
2  1002333   techMaster         UK      Premium
3  1002334    soccerFan     Brazil        Basic
4  1002335    travelBug  Australia      Premium

In [33]:

users_df.to_sql('users', engine, if_exists='append', index=False)

-1

In [ ]:
# pd.read_sql('users', engine)
user_id = users_df['userID']
movie_id = movies_df['movieID']
# user_id
# movie_id

0    80192187
1    81157374
2    80210920
Name: movieID, dtype: int64

In [52]:
watchs_df = pd.merge(user_id, movie_id, how='cross')
watchs_df

      userID   movieID
0    1002331  80192187
1    1002331  81157374
2    1002331  80210920
3    1002332  80192187
4    1002332  81157374
5    1002332  80210920
6    1002333  80192187
7    1002333  81157374
8    1002333  80210920
9    1002334  80192187
10   1002334  81157374
11   1002334  80210920
12   1002335  80192187
13   1002335  81157374
14   1002335  80210920
15   1002336  80192187
16   1002336  81157374
17   1002336  80210920
18   1002337  80192187
19   1002337  81157374
20   1002337  80210920
21   1002338  80192187
22   1002338  81157374
23   1002338  80210920
24   1002339  80192187
25   1002339  81157374
26   1002339  80210920
27  10023310  80192187
28  10023310  81157374
29  10023310  80210920
30  10023311  80192187
31  10023311  81157374
32  10023311  80210920
33  10023312  80192187
34  10023312  81157374
35  10023312  80210920
36  10023313  80192187
37  10023313  81157374
38  10023313  80210920
39  10023314  80192187
40  10023314  81157374
41  10023314  80210920
42  10023315  80192187
43  10023315  81157374
44  10023315  80210920
45  10023316  80192187
46  10023316  81157374
47  10023316  80210920
48  10023317  80192187
49  10023317  81157374
50  10023317  80210920
51  10023318  80192187
52  10023318  81157374
53  10023318  80210920
54  10023319  80192187
55  10023319  81157374
56  10023319  80210920
57  10023320  80192187
58  10023320  81157374
59  10023320  80210920

In [ ]:
import random
from datetime import datetime, timedelta
import random

def gen_rating():
    numero_aleatorio = round(random.uniform(0, 5), 1)
    return numero_aleatorio

def gen_timestamp():
    start_date = datetime(2024, 1, 15)
    end_date = datetime(2024, 4, 6)
    random_date = start_date + timedelta(seconds=random.randint(0, int((end_date - start_date).total_seconds())))
    return random_date